## Assignment 1 - Exploratory Data Analysis

#### Step 1: Find and download a dataset.

In [1]:
# StreetEasy is New York Cityâ€™s leading real estate marketplace. You will be working with a
# dataset that contains a sample of 5,000 rentals listings in Manhattan.
# https://www.kaggle.com/zohaib30/streeteasy-dataset?select=manhattan.csv

In [2]:
# imports
import numpy                 as np
import pandas                as pd
import matplotlib.pyplot     as plt
import seaborn               as sns
import sklearn.metrics       as Metrics
import pandas                as pd
import matplotlib.pyplot     as plt

In [3]:
manhattan = pd.read_csv('manhattan.csv')
manhattan.shape
#below we can see our dataset has 3539 rows and 18 columns

(3539, 18)

#### Step 4: Data cleaning. Address any missing values in your training set. Include the code in your Jupyter notebook and create a second, cleaned, version of your dataset. Then apply the same procedure to you test set (if you are putting in replacement values use IMPUTER in scikitlearn).

In [4]:
manhattan.head(3)

,rental_id,rent,bedrooms,bathrooms,size_sqft,min_to_subway,floor,building_age_yrs,no_fee,has_roofdeck,has_washer_dryer,has_doorman,has_elevator,has_dishwasher,has_patio,has_gym,neighborhood,borough
0,1545,2550,0.0,1,480,9,2.0,17,1,1,0,0,1,1,0,1,Upper East Side,Manhattan
1,2472,11500,2.0,2,2000,4,1.0,96,0,0,0,0,0,0,0,0,Greenwich Village,Manhattan
2,2919,4500,1.0,1,916,2,51.0,29,0,1,0,1,1,1,0,0,Midtown,Manhattan

In [5]:
# I decided to convert the neighborhoods to numerical values becauses I believe it is an important variable
manhattan["neighborhood_code"] = pd.factorize(manhattan.neighborhood)[0]

In [6]:
# I'm dropping the neighborhood and borough to eliminate the string values
manhattan_coded = manhattan.drop(["borough","neighborhood"], axis=1)

In [7]:
manhattan_coded.head(3) # new dataset without string values

,rental_id,rent,bedrooms,bathrooms,size_sqft,min_to_subway,floor,building_age_yrs,no_fee,has_roofdeck,has_washer_dryer,has_doorman,has_elevator,has_dishwasher,has_patio,has_gym,neighborhood_code
0,1545,2550,0.0,1,480,9,2.0,17,1,1,0,0,1,1,0,1,0
1,2472,11500,2.0,2,2000,4,1.0,96,0,0,0,0,0,0,0,0,1
2,2919,4500,1.0,1,916,2,51.0,29,0,1,0,1,1,1,0,0,2

#### Step 2: Divide into a training set and a testing set. Use scikitlearn to divide you data into training and testing sets. Make sure that the testing and training sets are balanced in terms of target classes

In [8]:
y = manhattan_coded["rent"]
print(y.head())

0     2550
1    11500
2     4500
3     4795
4    17500
Name: rent, dtype: int64

In [9]:
X = manhattan_coded.drop(["rent"], axis=1)

In [15]:
from sklearn.model_selection import train_test_split

# split data and labels into a training and a test set
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=0)

#### Step 3: Explore your training set. Import your data into a Pandas data frame and use the following pandas functions to explore your data

In [13]:
X_train.isnull().sum() # not missing values

rental_id            0
bedrooms             0
bathrooms            0
size_sqft            0
min_to_subway        0
floor                0
building_age_yrs     0
no_fee               0
has_roofdeck         0
has_washer_dryer     0
has_doorman          0
has_elevator         0
has_dishwasher       0
has_patio            0
has_gym              0
neighborhood_code    0
dtype: int64

In [17]:
X_train.describe()

,rental_id,bedrooms,bathrooms,size_sqft,min_to_subway,floor,building_age_yrs,no_fee,has_roofdeck,has_washer_dryer,has_doorman,has_elevator,has_dishwasher,has_patio,has_gym,neighborhood_code
count,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000,2654.000000
mean,5296.205727,1.349849,1.368500,940.456669,4.900151,11.902600,51.725697,0.396383,0.156745,0.163904,0.282216,0.300678,0.190279,0.052751,0.176714,8.882442
std,3318.025785,0.970623,0.602047,477.489348,5.344821,11.058595,39.298995,0.489238,0.363628,0.370258,0.450163,0.458639,0.392595,0.223577,0.381499,6.261885
min,1.000000,0.000000,0.000000,250.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2402.500000,1.000000,1.000000,613.000000,2.000000,4.000000,15.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000
50%,5063.500000,1.000000,1.000000,800.000000,4.000000,8.000000,39.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,9.000000
75%,8159.000000,2.000000,2.000000,1150.000000,6.000000,17.000000,89.000000,1.000000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000,12.000000
max,11349.000000,5.000000,5.000000,3680.000000,43.000000,83.000000,180.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,31.000000

In [18]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2654 entries, 2079 to 2732
Data columns (total 16 columns):
rental_id            2654 non-null int64
bedrooms             2654 non-null float64
bathrooms            2654 non-null int64
size_sqft            2654 non-null int64
min_to_subway        2654 non-null int64
floor                2654 non-null float64
building_age_yrs     2654 non-null int64
no_fee               2654 non-null int64
has_roofdeck         2654 non-null int64
has_washer_dryer     2654 non-null int64
has_doorman          2654 non-null int64
has_elevator         2654 non-null int64
has_dishwasher       2654 non-null int64
has_patio            2654 non-null int64
has_gym              2654 non-null int64
neighborhood_code    2654 non-null int64
dtypes: float64(2), int64(14)
memory usage: 352.5 KB